; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation8 - direction
	Star4 - direction
	Star5 - direction
	GroundStation10 - direction
	GroundStation2 - direction
	Star13 - direction
	GroundStation14 - direction
	Star3 - direction
	Star9 - direction
	GroundStation12 - direction
	Star0 - direction
	GroundStation11 - direction
	GroundStation7 - direction
	Star6 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star9)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star13)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation12)
	(calibration_target instrument3 Star9)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation11)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
)
(:goal (and
	(have_image Star15 infrared1)
	(have_image Phenomenon16 infrared1)
	(have_image Planet17 image0)
	(have_image Phenomenon18 image0)
	(have_image Star19 image0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
2. (calibrate satellite1 instrument2 star13)
   added: (calibrated instrument2)
   goals met: 0 of 5
3. (turn_to satellite1 planet17 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet17)
   goals met: 0 of 5
4. (take_image satellite1 planet17 instrument2 image0)
   added: (have_image planet17 image0)
   goals met: 1 of 5
5. (turn_to satellite1 phenomenon18 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 phenomenon18)
   goals met: 1 of 5
6. (take_image satellite1 phenomenon18 instrument2 image0)
   added: (have_image phenomenon18 image0)
   goals met: 2 of 5
7. (turn_to satellite1 phenomenon16 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 5
8. (take_image satellite1 phenomenon16 instrument2 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 3 of 5
9. (turn_to satellite1 star15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star15)
   goals met: 3 of 5
10. (take_image satellite1 star15 instrument2 infrared1)
   added: (have_image star15 infrared1)
   goals met: 4 of 5
11. (turn_to satellite1 star19 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star19)
   goals met: 4 of 5
12. (take_image satellite1 star19 instrument2 image0)
   added: (have_image star19 image0)
   goals met: 5 of 5
